In [1]:
%load_ext sql

In [2]:
%sql postgresql://student:student@127.0.0.1/sparkifydb

'Connected: student@sparkifydb'

In [3]:
%sql SELECT * FROM songplays LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[(38, 1542845032796, 15, 'paid', None, None, 818, 'Chicago-Naperville-Elgin, IL-IN-WI', '"Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Ubuntu Chromium/36.0.1985.125 Chrome/36.0.1985.125 Safari/537.36"'),
 (39, 1542845350796, 15, 'paid', None, None, 818, 'Chicago-Naperville-Elgin, IL-IN-WI', '"Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Ubuntu Chromium/36.0.1985.125 Chrome/36.0.1985.125 Safari/537.36"'),
 (40, 1542845526796, 15, 'paid', None, None, 818, 'Chicago-Naperville-Elgin, IL-IN-WI', '"Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Ubuntu Chromium/36.0.1985.125 Chrome/36.0.1985.125 Safari/537.36"'),
 (41, 1542845741796, 15, 'paid', None, None, 818, 'Chicago-Naperville-Elgin, IL-IN-WI', '"Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Ubuntu Chromium/36.0.1985.125 Chrome/36.0.1985.125 Safari/537.36"'),
 (42, 1542846220796, 15, 'paid', None, None, 818, 'Chicago-Naperville-Elgin, IL-IN-WI', '"Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Ubuntu Chromium/36.0.1985.125 Chrome/36.0.1985.125 Safari/537.36"')]

In [4]:
%sql SELECT * FROM users LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[(15, 'Lily', 'Koch', 'F', 'paid'),
 (26, 'Ryan', 'Smith', 'M', 'free'),
 (50, 'Ava', 'Robinson', 'F', 'free'),
 (97, 'Kate', 'Harrell', 'F', 'paid'),
 (101, 'Jayden', 'Fox', 'M', 'free')]

In [5]:
%sql SELECT * FROM songs LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[('SOMJBYD12A6D4F8557', 'Keepin It Real (Skit)', 'ARD0S291187B9B7BF5', 0, 114.78159),
 ('SOQHXMF12AB0182363', 'Young Boy Blues', 'ARGSJW91187B9B1D6B', 0, 218.77506),
 ('SONHOTT12A8C13493C', 'Something Girls', 'AR7G5I41187FB4CE6C', 1982, 233.40363),
 ('SOUDSGM12AC9618304', 'Insatiable (Instrumental Version)', 'ARNTLGG11E2835DDB9', 0, 266.39628),
 ('SOYMRWW12A6D4FAB14', 'The Moon And I (Ordinary Day Album Version)', 'ARKFYS91187B98E58F', 0, 267.7024)]

In [6]:
%sql SELECT * FROM artists LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[('ARD0S291187B9B7BF5', 'Rated R', 'Ohio', nan, nan),
 ('ARGSJW91187B9B1D6B', 'JennyAnyKind', 'North Carolina', 35.21962, -80.01955),
 ('AR7G5I41187FB4CE6C', 'Adam Ant', 'London, England', nan, nan),
 ('ARNTLGG11E2835DDB9', 'Clp', '', nan, nan),
 ('ARKFYS91187B98E58F', 'Jeff And Sheri Easter', '', nan, nan)]

In [7]:
%sql SELECT * FROM time LIMIT 5;

 * postgresql://student:***@127.0.0.1/sparkifydb
5 rows affected.

[(1542845032796, 0, 22, 47, 11, 2018, 3),
 (1542845350796, 0, 22, 47, 11, 2018, 3),
 (1542845526796, 0, 22, 47, 11, 2018, 3),
 (1542845741796, 0, 22, 47, 11, 2018, 3),
 (1542846220796, 0, 22, 47, 11, 2018, 3)]

## REMEMBER: Restart this notebook to close connection to `sparkifydb`
Each time you run the cells above, remember to restart this notebook to close the connection to your database. Otherwise, you won't be able to run your code in `create_tables.py`, `etl.py`, or `etl.ipynb` files since you can't make multiple connections to the same database (in this case, sparkifydb).

In [1]:
import pandas as pd
from sql_queries import *
from create_tables import *
import psycopg2

In [36]:
import unittest

class SparkifyTests(unittest.TestCase):
    
    def test_connection(self):
        '''Tests ability to connect to the database'''
        try:
            conn = psycopg2.connect("host=127.0.0.1 dbname=sparkifydb user=student password=student")
            self.assertIsNotNone(conn)
            conn.close()
        except Exception as e:
            print('failed to create db connection')
            print(e)
    
    def test_cursor(self):
        '''Test the ability to connect to the db and open a cursor'''
        try:
            conn = psycopg2.connect("host=127.0.0.1 dbname=sparkifydb user=student password=student")
            cur = conn.cursor()
            self.assertIsNotNone(cur)
            conn.close()
        except Exception as e:
            print('failed to create db cursor')
            print(e)
    
    def test_songs(self):
        '''Test that the songs table is created and has the correct shape'''
        try:
            conn = psycopg2.connect("host=127.0.0.1 dbname=sparkifydb user=student password=student")
            cur = conn.cursor()
            cur.execute('SELECT * FROM songs LIMIT 5')
            row = cur.fetchone()
            self.assertTrue(len(row) == 5)
            self.assertTrue(type(row) == tuple)
            conn.close()
        except Exception as e:
            print('failed to validate songs table')
            print(e)
    
    def test_artists(self):
        '''Test that the artists table is created and has the correct shape'''
        try:
            conn = psycopg2.connect("host=127.0.0.1 dbname=sparkifydb user=student password=student")
            cur = conn.cursor()
            cur.execute('SELECT * FROM artists LIMIT 5')
            row = cur.fetchone()
            self.assertTrue(len(row) == 5)
            self.assertTrue(type(row) == tuple)
            conn.close()
        except Exception as e:
            print('failed to validate artists table')
            print(e)
    
    def test_songplays(self):
        '''Test that the songplays table is created and has the correct shape'''
        try:
            conn = psycopg2.connect("host=127.0.0.1 dbname=sparkifydb user=student password=student")
            cur = conn.cursor()
            cur.execute('SELECT * FROM songplays LIMIT 5')
            row = cur.fetchone()
            self.assertTrue(len(row) == 9)
            self.assertTrue(type(row) == tuple)
            conn.close()
        except Exception as e:
            print('failed to validate songplays table')
            print(e)
            
    def test_users(self):
        '''Test that the users table is created and has the correct shape'''
        try:
            conn = psycopg2.connect("host=127.0.0.1 dbname=sparkifydb user=student password=student")
            cur = conn.cursor()
            cur.execute('SELECT * FROM users LIMIT 5')
            row = cur.fetchone()
            self.assertTrue(len(row) == 5)
            self.assertTrue(type(row) == tuple)
            conn.close()
        except Exception as e:
            print('failed to validate users table')
            print(e)
            
    def test_time(self):
        '''Test that the time table is created and has the correct shape'''
        try:
            conn = psycopg2.connect("host=127.0.0.1 dbname=sparkifydb user=student password=student")
            cur = conn.cursor()
            cur.execute('SELECT * FROM time LIMIT 5')
            row = cur.fetchone()
            self.assertTrue(len(row) == 7)
            self.assertTrue(type(row) == tuple)
            conn.close()
        except Exception as e:
            print('failed to validate time table')
            print(e)
            
    def test_table_create(self):
        '''Test that the table creation statement wont cause and error if run multiple times'''
        stmt = None
        try:
            conn = psycopg2.connect("host=127.0.0.1 dbname=sparkifydb user=student password=student")
            cur = conn.cursor()
            for stmt in create_table_queries:
                cur.execute(stmt)
                cur.execute(stmt)
            conn.close()
        except Exception as e:
            print('Error creating table. SQL erroring follows:')
            print(stmt)
            print(e)

if __name__ == '__main__':
    unittest.main(argv=['ignore'], exit=False)

........
----------------------------------------------------------------------
Ran 8 tests in 0.104s

OK

In [6]:
conn = psycopg2.connect("host=127.0.0.1 dbname=sparkifydb user=student password=student")

In [7]:
cur = conn.cursor()

In [28]:
cur.execute('SELECT * FROM songplays LIMIT 5')
row = cur.fetchone()

In [29]:
len(row)

9

In [11]:
assert(len(row) == 5)
assert(type(row) == tuple)

['CREATE TABLE IF NOT EXISTS songplays (\n                                                    songplay_id INT NOT NULL UNIQUE,\n                                                    start_time BIGINT,\n                                                    user_id INT,\n                                                    level TEXT,\n                                                    song_id TEXT,\n                                                    artist_id TEXT,\n                                                    session_id INT,\n                                                    location TEXT,\n                                                    user_agent TEXT,\n                                                    PRIMARY KEY(songplay_id)\n                                                    )\n',
 'CREATE TABLE IF NOT EXISTS users (\n                                            user_id INT NOT NULL UNIQUE,\n                                            first_name TEXT,\n                                            last_name TEXT,\n                                            gender CHAR,\n                                            level TEXT,\n                                            PRIMARY KEY(user_id)\n                                            )\n',
 'CREATE TABLE IF NOT EXISTS songs (\n                                            song_id TEXT NOT NULL UNIQUE,\n                                            title TEXT,\n                                            artist_id TEXT,\n                                            year INT,\n                                            duration FLOAT,\n                                            PRIMARY KEY(song_id)\n                                            )\n',
 'CREATE TABLE IF NOT EXISTS artists (\n                                                artist_id TEXT NOT NULL UNIQUE,\n                                                name TEXT,\n                                                location TEXT,\n                                                lattitude FLOAT,\n                                                longitude FLOAT,\n                                                PRIMARY KEY(artist_id)\n                                               )\n',
 'CREATE TABLE IF NOT EXISTS time (\n                                            start_time BIGINT,\n                                            hour INT,\n                                            day INT,\n                                            week INT,\n                                            month INT,\n                                            year INT,\n                                            weekday INT\n                                          )\n']